PiBoxY/msp430ware/energy_measurement/gui/DeviceConfig/SourceTemplates/MSP430i2xx/lib/EM/include/emSwLib.h
#ifndef _EMSWLIB_H_
#define _EMSWLIB_H_

//#############################################################################
//
//! \file   emSwLib.h
//!
//! \brief  Contains all Energy Measurement SW Library enums, structs, macros, 
//!            function and global variables defintions
//!         
//
//  Group:          MSP
//  Target Device:  MSP430F677x1A, MSP430F673xA and MSP430i20xx 
//
//  (C) Copyright 2017, Texas Instruments, Inc.
//#############################################################################
// TI Release: MSP430_ENERGY_MEASUREMENT 
// Release Date: 10Jul2018
//#############################################################################


//*****************************************************************************
// includes
//*****************************************************************************
#include <msp430.h>

#include <stdint.h>
#include <stdbool.h>
#include "IQmathLib.h"
#include "QmathLib.h"

#ifdef __cplusplus

extern "C" {
#endif

//*****************************************************************************
// defines
//*****************************************************************************

 //! \brief This define can be used to mask the EM_Phase->phaseResultsSupported variable
 //! and determine if the VRMS is calculated by the EM_processSample().
 #define EM_PHASE_RESULT_CALC_VRMS                          BIT0
 //! \brief This define can be used to mask the EM_Phase->phaseResultsSupported variable
 //! and determine if the IRMS is calculated by the EM_processSample().
 #define EM_PHASE_RESULT_CALC_IRMS                          BIT1
 //! \brief This define can be used to mask the EM_Phase->phaseResultsSupported variable
 //! and determine if the V-PEAK is calculated by the EM_processSample().
 #define EM_PHASE_RESULT_CALC_V_PEAK                        BIT2
 //! \brief This define can be used to mask the EM_Phase->phaseResultsSupported variable
 //! and determine if the I-PEAK is calculated by the EM_processSample().
 #define EM_PHASE_RESULT_CALC_I_PEAK                        BIT3
 //! \brief This define can be used to mask the EM_Phase->phaseResultsSupported variable
 //! and determine if the POWER FACTOR is calculated by the EM_processSample().
 #define EM_PHASE_RESULT_CALC_POWER_FACTOR                  BIT4
 //! \brief This define can be used to mask the EM_Phase->phaseResultsSupported variable
 //! and determine if the Frequency is calculated by the EM_processSample().
 #define EM_PHASE_RESULT_CALC_FREQ                          BIT5
//! \brief This define can be used to mask the EM_Phase->phaseResultsSupported variable
//! and determine if the ACTIVE POWER is calculated by the EM_processSample(). 
#define EM_PHASE_RESULT_CALC_ACTIVE_POWER					BIT6
//! \brief This define can be used to mask the EM_Phase->phaseResultsSupported variable
//! and determine if the REACTIVE POWER is calculated by the EM_processSample(). 
#define EM_PHASE_RESULT_CALC_REACTIVE_POWER					BIT7
//! \brief This define can be used to mask the EM_Phase->phaseResultsSupported variable
//! and determine if the APPARENT POWER is calculated by the EM_processSample(). 
#define EM_PHASE_RESULT_CALC_APPARENT_POWER					BIT8
//! \brief This define can be used to mask the EM_Phase->phaseResultsSupported variable
//! and determine if the ACTIVE ENERGY is calculated by the EM_processSample(). 
#define EM_PHASE_RESULT_CALC_ACTIVE_ENERGY					BIT9
//! \brief This define can be used to mask the EM_Phase->phaseResultsSupported variable
//! and determine if the REACTIVE ENERGY is calculated by the EM_processSample(). 
#define EM_PHASE_RESULT_CALC_REACTIVE_ENERGY				BIT10
//! \brief This define can be used to mask the EM_Phase->phaseResultsSupported variable
//! and determine if the APPARENT ENERGY is calculated by the EM_processSample(). 
#define EM_PHASE_RESULT_CALC_APPARENT_ENERGY				BIT11

 //! \brief This define can be used to mask the EM_System_Configuration->pulseGeneration
 //! variable . This is used by the EM_genPulseIndPhase() to generate pulses for Phase A
#define EM_PULSE_GEN_PHASE_NONE                             (0x00)
 //! \brief This define can be used to mask the EM_System_Configuration->pulseGeneration
 //! variable . This is used by the EM_genPulseIndPhase() to generate pulses for Phase A
#define EM_PULSE_GEN_PHASE_A                                (0x01)
 //! \brief This define can be used to mask the EM_System_Configuration->pulseGeneration
 //! variable . This is used by the EM_genPulseIndPhase() to generate pulses for Phase B
#define EM_PULSE_GEN_PHASE_B                                (0x02)
 //! \brief This define can be used to mask the EM_System_Configuration->pulseGeneration
 //! variable . This is used by the EM_genPulseIndPhase() to generate pulses for Phase C
#define EM_PULSE_GEN_PHASE_C                                (0x04)
 //! \brief This define can be used to mask the EM_System_Configuration->pulseGeneration
 //! variable . This is used by the EM_genPulseIndPhase() to generate pulses for Phase D
#define EM_PULSE_GEN_PHASE_D                                (0x08)
 //! \brief This define can be used to mask the EM_System_Configuration->pulseGeneration
 //! variable . This is used by the EM_genPulseIndPhase() to generate pulses for Phase E
#define EM_PULSE_GEN_PHASE_E                                (0x10)
 //! \brief This define can be used to mask the EM_System_Configuration->pulseGeneration
 //! variable . This is used by the EM_genPulseIndPhase() to generate pulses for Phase F
#define EM_PULSE_GEN_PHASE_F                                (0x20)
 //! \brief This define can be used to mask the EM_System_Configuration->pulseGeneration
 //! variable . This is used by the EM_genPulseIndPhase() to generate pulses for Phase
 //! neutral.
#define EM_PULSE_GEN_PHASE_NEUTRAL                          (0x40)
 //! \brief This define can be used to mask the EM_System_Configuration->pulseGeneration
 //! variable . This is used by the EM_genPulseTotalPhases() to generate pulses for the
 //! aggregate total.
#define EM_PULSE_GEN_PHASE_AGGREGATE                        (0x80)

//*****************************************************************************
// typedefs
//*****************************************************************************

//! \brief The following enumeration contain all possible EM SW Library return
//!         message codes.
//!
typedef enum _EM_message_code_
{

