PiBoxY/msp430ware/energy_measurement/gui/DeviceConfig/SourceTemplates/MSP430i2xx/lib/EM/include/emSwLib.h
	EM_message_code_no_error=0,
	//!< This message code is returned when no error was detected while 
	//!< invoking the API.

	// 1-20 reserved for system configuration messages
    EM_message_code_pulseArray_error=1,
    //!< This error is returned if pulseArrayLength is greater than 0
    //!< and pulseArray is 0
	EM_message_code_indPhaseMeter_error=2,
    //!< This error is returned if pulseArrayLength is greater than 0
	//!< and indPhaseMeterConstant is 0
	EM_message_code_indPhasePulseDuration_error=3,
    //!< This error is returned if pulseArrayLength is greater than 0
    //!< and indPhasePulseDuration is 0
    EM_message_code_totalPhaseMeter_error=4,
    //!< This error is returned if pulseArrayLength is greater than 0,
    //!< totalPhaseMeterConstant is 0 and the pulseGeneration has
    //!< the EM_PULSE_GEN_PHASE_AGGREGATE flag set
    EM_message_code_totalPhasePulseDuration_error=5,
    //!< This error is returned if pulseArrayLength is greater than 0
    //!< and totalPhasePulseDuration is 0 and the pulseGeneration has
    //!< the EM_PULSE_GEN_PHASE_AGGREGATE flag set

	// 21-40 reserved for algorithm configuration messages
    EM_message_code_samplingFrequency_error=21,
    //!< This error is returned if the sampling frequency is not greater than 0
    EM_message_code_reactPowLength_error=22,
    //!< This error is returned if the reactPowIIRTable ptr is null and
    //!< the reactPowIIRLength variable is greater than 0
    EM_message_code_reactPowIIRTable_error=23,
    //!< This error is returned if the reactPowIIRLength is greater than 0
    //!< and the reactPowIIRTable ptr is equal to 0
	
	// 41-59 reserved for meter configuration messages
    EM_message_code_phaseLength_error=41,
    //!< This error is returned if the phaseLength is equal to 0
    EM_message_code_phaseConfig_error=41,
    //!< This error is returned if the phaseConfigPtr is equal to 0

	// 60-249 reserved for calibration messages
	EM_message_code_calibrate_invalidPhase_error=81,
	//!< This error is returned if the phase number is invalid

	//240-255 error
	EM_message_code_error_occurred=255
	//!< This is a generic error this is error that is returned if an unhandled
	//!< error occurs
} EM_message_code;

//! \brief Selects appropriate EM Sensor for the corresponding channel
//!
typedef enum _EM_Current_Sensor_
{
	EM_Phase_Sensor_CT=0,
	//!< Current Transformer (CT) 
	EM_Phase_Sensor_Shunt=1,
	//!< Shunt
    EM_Phase_Sensor_RC=2,
    //!< Rogowski Coil (RC)
} EM_Current_Sensor;

//! \brief Type for Power variables
//!
typedef int64_t EM_Power_t;

//! \brief Type for Energy variables
//!
typedef uint64_t EM_Energy_t;

//! \brief Selects appropiate phase to provide results for
//!
typedef enum _EM_Phase_
{
	EM_Phase_A=0x01,
	//!< - Results requested for phase A
	EM_Phase_B=0x02,
	//!< - Results requested for phase B
	EM_Phase_C=0x04,
	//!< - Results requested for phase C
	EM_Phase_D=0x08,
	//!< - Results requested for phase D
	EM_Phase_E=0x10,
	//!< - Results requested for phase E
	EM_Phase_F=0x20,
	//!< - Results requested for phase F
	EM_Phase_Neutral=0x40
	//!< - Results requested for phase Neutral
} EM_Phase;


//! \brief Contains EM SW Lib Phase Calibration
//!
typedef struct _EM_Pulse_Settings_
{
	uint8_t activePulseGpioPort;
	//!< Each phase uses a GPIO port used to generate a pulse used for calibration
	//!< Possible options for each port:
	//!< - GPIO_PORT_P1
	//!< - GPIO_PORT_P2
	//!< - GPIO_PORT_P3
	//!< - GPIO_PORT_P4
	//!< - GPIO_PORT_P5
	//!< - GPIO_PORT_P6
	//!< - GPIO_PORT_P7
	//!< - GPIO_PORT_P8
	//!< - GPIO_PORT_P9
	uint8_t reactivePulseGpioPort;
	//!< Each phase uses a GPIO port used to generate a pulse used for calibration
	//!< Possible options for each port:
	//!< - GPIO_PORT_P1
	//!< - GPIO_PORT_P2
	//!< - GPIO_PORT_P3
	//!< - GPIO_PORT_P4
	//!< - GPIO_PORT_P5
	//!< - GPIO_PORT_P6
	//!< - GPIO_PORT_P7
	//!< - GPIO_PORT_P8
	//!< - GPIO_PORT_P9
	uint16_t activePulseGpioPin;
	//!< Each phase uses a GPIO pin used to generate a pulse used for calibration
	//!< Possible options for each pin:
	//!< - GPIO_PIN0
	//!< - GPIO_PIN1
	//!< - GPIO_PIN2
	//!< - GPIO_PIN3
	//!< - GPIO_PIN4
	//!< - GPIO_PIN5
	//!< - GPIO_PIN6
	//!< - GPIO_PIN7
	uint16_t reactivePulseGpioPin;
	//!< Each phase uses a GPIO pin used to generate a pulse used for calibration
	//!< Possible options for each pin:
	//!< - GPIO_PIN0
	//!< - GPIO_PIN1
	//!< - GPIO_PIN2
	//!< - GPIO_PIN3
	//!< - GPIO_PIN4
	//!< - GPIO_PIN5
	//!< - GPIO_PIN6
	//!< - GPIO_PIN7
    uint64_t activeEnergyCounter;
    //!< Ongoing Active Energy Sum
    uint16_t activeEnergyPulseRemaining;
    //!< Counter used to keep track of remaining ADC samples to keep pulse high
	uint64_t reactiveEnergyCounter;
	//!< Ongoing Reactive Energy Sum
    uint16_t reactiveEnergyPulseRemaining;
    //!< Counter used to keep track of remaining ADC samples to keep pulse high
} EM_Pulse_Settings;

//! \brief Contains EM SW Lib System Configuration
//!
typedef struct _EM_System_Configuration_
{
	EM_Pulse_Settings *pulseArray;
	//!< Pointer to the location where the pulse configuration is stored 
	//!< (one for each phase)
	uint8_t pulseArrayLength;
	//!< Length of the pulseArray configuration
	uint64_t indPhaseMeterConstant;
	//!< Number of pulses for each / kWH (active energy) or number of pulses 
	//!< for each / kVarh (reactive energy) for each phase
	uint16_t indPhasePulseDuration;
	//!< Pulse duration in ADC counts for each active / reactive energy
	uint64_t totalPhaseMeterConstant;
	//!< Number of pulses for each / kWH for the cumulative total active
	//!< energy or number of pulses for each / kVarh for the cumulative
	//!< reactive energy
	uint16_t totalPhasePulseDuration;
	//!< Pulse duration in ADC counts for the cumulative total of active
	//!< / reactive energy
	uint8_t pulseGeneration;
    //!< Register used to enable / disable the phase pulse flag:
    //!< - EM_PULSE_GEN_PHASE_A
	//!< - EM_PULSE_GEN_PHASE_B
	//!< - EM_PULSE_GEN_PHASE_C
	//!< - EM_PULSE_GEN_PHASE_D
	//!< - EM_PULSE_GEN_PHASE_E
	//!< - EM_PULSE_GEN_PHASE_F
	//!< - EM_PULSE_GEN_PHASE_NEUTRAL
	//!< - EM_PULSE_GEN_PHASE_AGGREGATE
} EM_System_Configuration;


//! \brief Contains EM SW Lib Phase Calibration
//!
typedef struct _EM_Phase_Calibration_
{
	uint32_t voltageSF;
	//!< Voltage Scaling Factor - used to calculate VRMS
	uint32_t currentSF;
	//!< Current Scaling Factor - used to calculate IRMS
	uint32_t activePowerSF;
	//!< Active Power Scaling Factor
	uint32_t reactivePowerSF;
	//!< Active Power Scaling Factor
	int16_t phaseCorrection;
	//!< Phase Correction between voltage and current (register units)

} EM_Phase_Calibration;

//! \brief Contains EM SW Lib System Configuration
//!
typedef struct _EM_Phase_Configuration_
{
	int32_t *currentSamplePtr;
	//!< Pointer to the current sample
	int16_t *voltageSamplePtr;
	//!< Pointer to the voltage sample
	EM_Current_Sensor currentSensor;
	//!< Sensor connected to the current (I) channel
	uint16_t phaseResultsSupported;
	//!< Register used to read what results will be calculated for this phase
	//!< Note: This is a Read-Only register. 
	//!< Possible mask values are:
    //!< - EM_PHASE_RESULT_CALC_VRMS
    //!< - EM_PHASE_RESULT_CALC_IRMS
    //!< - EM_PHASE_RESULT_CALC_V_PEAK
    //!< - EM_PHASE_RESULT_CALC_I_PEAK
    //!< - EM_PHASE_RESULT_CALC_POWER_FACTOR
    //!< - EM_PHASE_RESULT_CALC_FREQ
	//!< - EM_PHASE_RESULT_CALC_ACTIVE_POWER
	//!< - EM_PHASE_RESULT_CALC_REACTIVE_POWER
	//!< - EM_PHASE_RESULT_CALC_APPARENT_POWER
	//!< - EM_PHASE_RESULT_CALC_ACTIVE_ENERGY
	//!< - EM_PHASE_RESULT_CALC_REACTIVE_ENERGY
	//!< - EM_PHASE_RESULT_CALC_APPARENT_ENERGY
	EM_Phase_Calibration *phaseCalibPtr;
	//!< Pointer to EM_Phase_Calibration struct
} EM_Phase_Configuration;

//! \brief Contains EM SW Lib Meter Configuration
//!
typedef struct _EM_Meter_Configuration_
{
	EM_Phase_Configuration *phaseConfigPtr;
	//!< Pointer to the EM_Phase_Configuration struct buffer
	uint8_t phaseLength;
	//!< Length of the emPhasePtr buffer
	uint8_t *meterName;
	//!< Pointer to meter name string
	uint8_t *libVersionNumber;
	//!< Pointer to library version number string
	uint8_t *meterPW;
	//~< Pointer to meter password string
} EM_Meter_Configuration;

//! \brief Contains EM SW Lib Algorithm Configuration
//!
typedef struct _EM_Algorithm_Configuration_
{
    EM_Power_t residualPowerCutoff;
	//!< Residual Power Cutoff per each phase. This threshold is used as the minimum 
	//!< value of power to store. Power values below this value will not be stored.
    EM_Power_t totalResidualPowerCutoff;
	//!< Residual Power Cutoff for the sum of all the phases. If the sum of all phase  
	//!< power values is below this value, the total power value will not be updated.
	uint8_t mainNomFreq;
	//!< Nominal Freq value for the system (Hz)
    _iq29 sqrtTwoConst;
    //!< Square of 2 constant used for Vpeak and Ipeak calculations
    _iq30 energyCalcConst;
    //!< One dividing by (3600 x sampling frequency)
    uint16_t freqSampling;
    //!< Sampling Frequency (Hz)
    uint16_t reactPowIIRMinFreq;
    //!< Min Frequency for the IIR coefficient table
    uint8_t reactPowIIRShift;
    //!< Number of shifts required to calculated index for IIR table
    uint16_t reactPowIIRLength;
    //!< Length of the IIR coefficient table
    _iq30 *reactPowIIRTable;
} EM_Algorithm_Configuration;

//! \brief Contains EM SW Lib Config Handle
//!
typedef struct _EM_SW_Lib_Config_Handle_
{
	EM_System_Configuration *systemConfig;
	//!< Pointer to EM_System_Configuration struct
	EM_Algorithm_Configuration *algorithmConfig;
	//!< Pointer to EM_Algorithm_Configuration struct
	EM_Meter_Configuration *meterConfig;
	//!< Pointer to EM_Meter_Configuration struct
} EM_SW_Lib_Config_Handle;

typedef struct _EM_Metrology_
{
    int16_t sampleCount;
    //!< Number of samples being accumulated in the block of processed
    //!< signals being gathered used for the oneDivSC calculation.
    int64_t actPowDotProd;
    //!< Accumulated multiplication of the phase corrected current and voltage (I.V)
    //!< used for the active power calculation.
    int64_t reactPowDotProd;
    //!< Accumulated multiplication of the phase corrected current and voltage 90 (I.V90)
    //!< used for the reactive power calculation.
    int16_t vDotProd[3];
    //!< Accumulated squares of the phase corrected voltage (V.V). These are used to
    //!< calculate the RMS voltage, and the power factor. We need separate accumulation
    //!< for each current sensor, as we accumulate the phase corrected voltage which matches
    //!< the current sensor's phase shift.
    int64_t iDotProd;
    //!< Accumulated squares of the phase corrected current (I.I). These are used to
    //!< calculate the RMS current, and the power factor. We need separate accumulation
    //!< for each current sensor, as we accumulate the phase corrected voltage which matches
    //!< the current sensor's phase shift.
    uint16_t cycleSampleCount;
    //!< This is a count of the number of samples to date in the current mains cycle. This
    //!< is used to calculate the mainPeriod.
    _iq30 reactPowGConst;
    //!< G Constant used for the IIR filter to calculate Reactive Power
    uint32_t mainPeriod;
    //!< This a running average of the length of a mains cycle. (samples/cycle * 256)
    uint32_t prevMainPeriod;
    //!< This a running average of the length of a mains cycle. (samples/cycle * 256)
    _iq30 oneDivSC;
    //!< Constant used to calculate the VRMS,IRMS, power and energy values (1/sample_count)
    uint16_t prevSampleCount;
    //!< Stores the prev sample count used to calculate oneDivSC. This is used to avoid
    //!< calculating 1/SC each cycle.
    uint8_t cycleCount;
    //!< Number of zero crossings. Once this number has reached the # of nominal freq.
    //!< For example for 50.2 Hz, once it reaches 50 cycles then the foreground is triggered.
} EM_Metrology;

//! \brief Contains EM Phase Background Results
//!
typedef struct _EM_Phase_BG_Results_
{
    int32_t vDCEstimate;
    //!< DC Estimate for Voltage
    int16_t iDCEstimate[3];
    //!< DC Estimate for Current
    int16_t reactPowPrevV90;
    //!< Previous V90 voltage used for the IIR filter in the reactive power calculation.
    int16_t vPrevSample;
    //!< Previous Voltage sample used for the IIR filter in the reactive power calculation.
    int32_t rogowskiPrevI90;
    //!< Previous I90 current used for the IIR filter in the Rogowski ADC current calculation.
    int32_t iPrevSample;
    //!< Previous Current sample used for the IIR filter in the Rogowski ADC current calculation.
}EM_Phase_BG_Results;

