PiBoxY/msp430ware/energy_measurement/gui/DeviceConfig/SourceTemplates/MSP430i2xx/lib/EM/include/emSwLib.h
//! \brief Contains EM Phase Result
//!
typedef struct _EM_Phase_Results_
{
    uint32_t VRMS;
    //!< VRMS for previous frame (mV)
    uint32_t IRMS;
    //!< IRMS for previous frame (uA)
    uint32_t vPeak;
    //!< VPeak since system initialization (mV)
    uint32_t iPeak;
    //!< IPeak since system initialization (uA)
    int32_t powerFactor;
    //!< Power Factor calculated when the EM_powerFactor
    uint16_t frequency;
    //!< The Frequency is stored in 0.01Hz steps. A 16 bit unsigned number supports the range
    //!< 0.01Hz to 655.35Hz, which is clearly more than we will ever need for the fundamental.
    EM_Power_t activePower;
	//!< Active Power for previous frame (uW)
	EM_Power_t reactivePower;
	//!< Reactive Power for previous frame (uVAr)
	EM_Power_t apparentPower;
	//!< Apparent Power for previous frame (uVA)
	EM_Energy_t activeEnergy;
	//!< Active Energy for previous frame (uWh)
	EM_Energy_t reactiveEnergy;
	//!< Reactive Energy for previous frame (uVArh)
	EM_Energy_t apparentEnergy;
	//!< Apparent Energy for previous frame (uVAh)
	EM_Phase phaseID;
	//!< Present Phase ID Name
} EM_Phase_Results;

//! \brief Contains EM Total Results
//!
typedef struct _EM_Total_Results_
{
	EM_Power_t activePower;
	//!< Total Active Power since system initialization (uW)
	EM_Power_t reactivePower;
	//!< Total Reactive Power since system initialization (uVAr)
	EM_Power_t apparentPower;
	//!< Total Apparent Power since system initialization (uVA)
    EM_Energy_t activeEnergy;
    //!< Total Active Energy consumed since system initialization (uWh)
    EM_Energy_t reactiveEnergy;
    //!< Total Reactive Energy consumed since system initialization (uVArh)
    EM_Energy_t apparentEnergy;
    //!< Total Apparent Energy consumed since system initialization (UVAh)
} EM_Total_Results;

//! \brief Contains EM SW Lib Result Handle
//!
typedef struct _EM_SW_Lib_Result_Handle_
{
	EM_Total_Results *emTotalResult;
	//!< Pointer to EM_Total_Results struct
	EM_Phase_Results *phaseResults;
	//!< Pointer to EM_Phase_Result struct buffer
	EM_Phase_BG_Results *phaseBGResults;
	//!<  Pointer to the EM_Phase_BG_Results struct buffer
	EM_Metrology **phaseMetrologyPing;
	//!< Pointer to EM_Metrology struct Ping buffer
    EM_Metrology **phaseMetrologyPong;
    //!< Pointer to EM_Metrology struct Pong buffer
	uint8_t phaseResultsSupportedLen;
	//!< Length of the phaseResultsSupportedPtr buffer
} EM_SW_Lib_Result_Handle;

//*****************************************************************************
// globals
//*****************************************************************************
//! \brief The following variable is used as a maximum ADC count to detect frequency.
extern uint16_t * EMSWLIB_EM_HAL_ADC_maxFreqCount;

//! \brief The following variable is used as a minimum ADC count to detect frequency.
extern uint16_t * EMSWLIB_EM_HAL_ADC_minFreqCount;

//*****************************************************************************
// the function prototypes
//*****************************************************************************

/*******************************************************************************
 * EM SW LIBRARY CONFIGURATION APIS
 ******************************************************************************/
//*****************************************************************************
//
//! \addtogroup configuration_api
//! @{
//
//******************************************************************************
//! \brief The following API initializes the variables needed by the library at
//! run time. This includes the G constant value used for the IIR filter,  1 over
//! sample count and 1 / (3600 * sampling frequency) which are used to calculate
//! metrology results. This function also checks for configuration errors.
//!
//! \param[in] config  is a pointer to the EM SW Library user configuration
//! \param[in] result  is a pointer to the EM SW Result configuration
//!
//! \return EM_message_code
//!
extern EM_message_code EM_configureEnergyMeasurement(
		EM_SW_Lib_Config_Handle *config,
		EM_SW_Lib_Result_Handle *result);

//! \brief The following API initializes the voltage / current DC filters to 0.
//!
//! \param[in] config  is a pointer to the EM SW Library user configuration
//! \param[in] result  is a pointer to the EM SW Result configuration
//!
//! \return None
//!
extern void EM_initDCFilters(
        EM_SW_Lib_Config_Handle *config,
        EM_SW_Lib_Result_Handle *result);

//******************************************************************************
//
// Close the Doxygen group.
//! @}
//
//******************************************************************************

/*******************************************************************************
 * EM SW LIBRARY CALIBRATION APIS
 ******************************************************************************/
//*****************************************************************************
//
//! \addtogroup calibration_api
//! @{
//
//******************************************************************************
//! \brief    The following API is used to copies calibration values from
//!           flapFlashCalibration to pWorkingCalibration if the flash has been
//!           written to during the calibration process. If the flash
//!           buffer has not been written to, then the default values stored in
//!           pWorkingCalibration will be used at run time.
//!
//! \param[in] pWorkingCalibration  is a pointer to the working calibration buffer
//! \param[in] pFlashCalibration  is a pointer to the flash calibration buffer
//!
//! \return None
//!
extern void EM_initalizeCalibrationValues(
        uint8_t *pWorkingCalibration,
        uint8_t *pFlashCalibration);

//! \brief    The following API is used  store working (RAM) pWorkingCalibration
//!           values to the pFlashCalibration structure stored in flash. When
//!           there is a power cycle this values will be loaded to the working
//!           calibration buffer by using the EM_initalizeCalibrationValues API.
//!
//! \param[in] pWorkingCalibration  is a pointer to the working calibration buffer
//! \param[in] pFlashCalibration  is a pointer to the flash calibration buffer
//!
//! \return None
//!
extern void EM_updateFlashCalibrationValues(
        uint8_t *pWorkingCalibration,
        uint8_t *pFlashCalibration);

