PiBoxY/msp430ware/energy_measurement/gui/DeviceConfig/SourceTemplates/MSP430i2xx/lib/EM/include/emSwLib.h
//******************************************************************************
//
// Close the Doxygen group.
//! @}
//
//******************************************************************************

/*******************************************************************************
 * EM SW LIBRARY RESULT APIS
 ******************************************************************************/
//*****************************************************************************
//
//! \addtogroup result_api
//! @{
//
//******************************************************************************
//! \brief The following API is intended for the removal of the DC content from
//! 16 bit 50Hz/60Hz mains signals. All samples should be passed through the
//! filter, in sequence, to obtain a signal free of DC content. The estimation
//! is based on a noise shaped single pole LPF.The cutoff frequency of this
//! filter is set very low, so its gain is essentially flat from 45Hz upwards.
//! This means the filter can take several seconds to stabilize when the
//! signal is initially applied.
//!
//! \param[in] p  is a pointer to the filter state variable
//! \param[in] x  is the next signal sample
//!
//! \return None
//!
extern int16_t EM_voltageDCFilter(
        int32_t *p,
        int16_t x);

//! \brief The following API is intended for the removal of the DC content from
//! 24 bit 50Hz/60Hz mains signals. All samples should be passed through the
//! filter, in sequence, to obtain a signal free of DC content. The estimation
//! is based on a noise shaped single pole LPF.The cutoff frequency of this
//! filter is set very low, so its gain is essentially flat from 45Hz upwards.
//! This means the filter can take several seconds to stabilize when the
//! signal is initially applied.
//!
//! \param[in] p  is a pointer to the filter state variable
//! \param[in] x  is the next signal sample
//!
//! \return None
//!
extern int32_t EM_currentDCFilter(
        int16_t p[3],
        int32_t x);

//! \brief    The following API is used update the previous voltage
//! value for a phase and to increment the number of samples processed
//! in the ISR. This API must be called inside the ISR after all the background
//! APIs are executed for a phase.
//!
//! \param[in] metro  is a pointer to the EM SW Metrology structure (Ping Ptr)
//! \param[in] phase  is a pointer to the EM SW Phase structure
//! \param[in] bgData  is a pointer to the EM RP Phase Results structure
//!
//! \return None
//!
extern void EM_perSample(
        EM_Metrology *metro,
        EM_Phase_Configuration *phase,
        EM_Phase_BG_Results *bgData);

//! \brief    The following API is used to swap the metrology ping and pong
//! pointers. This API must be executed after the Frequency Function
//! has processed N number of cycles (where N = config->algoConfig->mainNomFreq).
//! The Metrology Ping struc is the buffer updated in the ISR, and Metrology Pong
//! struct is used by the foreground APIs.
//!
//! \param[in] config  is a pointer to the EM SW Library user configuration
//! \param[in] result  is a pointer to the EM SW Library result structure
//! \param[in] phaseIdx  is the index for the phase
//!
//! \return None
//!
extern void EM_perDataChunk(
        EM_SW_Lib_Config_Handle *config,
        EM_SW_Lib_Result_Handle *result,
        uint16_t phaseIdx);

//! \brief    The following API is used to delay the current degree by 90 degrees.
//! It uses an IIR filter with 1 pole to shift current: (all pass 90 degree filter
//! for w = PI*f/fs, f=signal freq and fs = sampling frequency)
//! I90(IDX0 = I(IDX-1)+G*[I(IDX) - I90(IDX-1)] G = (tan(w) - 1)/(tan(w) + 1)
//! The G constant used by the filter is based on signal
//! frequency which is updated ~ once a second. It updates metro Result structure;
//! storing the temporary multiply accumulate (MAC) calculations.
//!
//! \param[in] metro  is a pointer to the EM SW Metrology structure (Ping Ptr)
//! \param[in] phase  is a pointer to the EM SW Phase structure
//! \param[in] bgData  is a pointer to the EM SW BG Result structure
//!
//! \return None
extern void EM_delayCurrent90Degrees(EM_Metrology *metro,
                                     EM_Phase_Configuration *phase,
                                     EM_Phase_BG_Results *bgData);

//! \brief    The following API is used to generate pulses for an individual
//! phase. This API checks if the config->pulseGeneration has the result->
//! phaseID set. If is set then it will generate EM_PHASE_IMP_PER_KWHR impulses
//! per kWhr. This API requires that the pulse settings are initialized for the
//! activePulse and reactivePulse Port/Pins.
//!
//! \param[in] config  is a pointer to the EM SW Library user configuration
//! \param[in] pulse  is a pointer to the EM SW Library pulse structure
//! \param[in] result  is a pointer to the EM SW Library result structure
//!
//! \return None
//!
extern void EM_genPulseIndPhase(
        EM_System_Configuration *config,
        EM_Pulse_Settings *pulse,
        EM_Phase_Results *result);

//! \brief    The following API is used to generate pulses for the total
//! phase. This API checks if the config->pulseGeneration has EM_PULSE_GEN_PHASE_AGGREGATE
//!  set. If is set then it will generate EM_PHASE_IMP_PER_KWHR impulses
//! per kWhr. This API requires that the pulse settings are initialized for the
//! activePulse and reactivePulse Port/Pins.
//!
//! \param[in] config  is a pointer to the EM SW Library user configuration
//! \param[in] pulse  is a pointer to the EM SW Library pulse structure
//! \param[in] result  is a pointer to the EM SW Library result structure
//!
//! \return None
//!
extern void EM_genPulseTotalPhases(
        EM_System_Configuration *config,
        EM_Pulse_Settings *pulse,
        EM_Total_Results *result);

//! \brief    The following API is used to calculate the 1/sample_count constant.
//! This function must be executed after EM_perDataChunk API for each phase inside
//! the foreground code. The 1/sample_count constant will be used to calculate
//! the results parameters.
//!
//! \param[in] metro  is a pointer to the EM SW Metrology structure (Pong Ptr)
//!
//! \return None
//!
extern void EM_updateOneDivSC(
        EM_Metrology *metro);

//! \brief    The following API is used to clear the temporary variables inside
//! the metro structure. This API must be called as the last API in the
//! foreground code.
//!
//! \param[in] metro  is a pointer to the EM SW Metrology structure (Pong Ptr)
//!
//! \return None
//!
extern void EM_clearMetrology(
        EM_Metrology *metro);

