PiBoxY/msp430ware/energy_measurement/gui/DeviceConfig/SourceTemplates/MSP430i2xx/lib/EM/include/emSwLib.h
//! \brief    The following API is used to look up the IIR G constant used to
//! calculate the Reactive Power using the current frequency value. The
//! index of the G constant in the reactPowIIRTable is calculated:
//! index = (Current Frequency - reactPowIIRMinFreq) >> reactPowIIRShift
//! if the index is > reactPowIIRLength, then index = reactPowIIRLength
//!
//! \param[in] metro  is a pointer to the EM SW Metrology structure (Pong Ptr)
//! \param[in] result  is a pointer to the EM SW Result structure
//! \param[in] algo  is a pointer to the EM SW Algorithm structure
//!
//! \return None
//!
extern void EM_updateReactPowConst(EM_Metrology *metro,
                                   EM_Phase_Results *result,
                                   EM_Algorithm_Configuration *algo);

//! \brief    The following API is used process the samples. It is used to 
//! calculate intermediate dot product results that are fed into the foreground 
//! process for the calculation of metrology readings.
//!
//! \param[in] config  is a pointer to the EM SW Library user configuration
//!
//! \return EM_message_code
//!
extern EM_message_code EM_processSample(
		EM_SW_Lib_Config_Handle *config);

//! \brief    The following API is used to calculate the dot product and
//! accumulation of Voltage and Current. This API reads the current and voltage
//! values using the phase structure.It updates metro Result structure; storing
//! the temporary multiply accumulate (MAC) calculations. The MAC value is used
//! by the foreground function EM_calcActivePowerDiv to calculate Active Power.
//!
//! \param[in] metro  is a pointer to the EM SW Metrology structure (Ping Ptr)
//! \param[in] phase  is a pointer to the EM SW Phase structure
//!
//! \return None
//!
extern void EM_calcActivePowerMultAcc(
        EM_Metrology *metro,
        EM_Phase_Configuration *phase);

//! \brief    The following API is used to calculate the active power in the
//! foreground code and store activePower in the result structure. The formula used:
//! (metro->AP_dot_prod->P_accum x metro->oneDivSC) x phase->phaseCalibPtr->activePowerSF
//! If the activePower calculated is less than algo->residualPowerCutoff
//! then activePower will be set to 0.
//!
//! \param[in] metro  is a pointer to the EM SW Metrology structure (Pong Ptr)
//! \param[in] phase  is a pointer to the EM SW Phase structure
//! \param[in] result  is a pointer to the EM SW Result structure
//! \param[in] algo  is a pointer to the EM SW Algorithm structure
//!
//! \return None
//!
extern void EM_calcActivePowerDiv(
        EM_Metrology *metro,
        EM_Phase_Configuration *phase,
        EM_Phase_Results *result,
        EM_Algorithm_Configuration *algo);

//! \brief    The following API is used to calculate the active energy result.
//! The formula used to calculate activeEnergy (uWh):
//! (result->activePower x metro->sampleCount) x energyCalcConst
//! Where energyCalcConst = (1/(sampling freq  x 3600))
//! This API must be called after EM_calcActivePowerDiv.
//!
//! \param[in] metro  is a pointer to the EM SW Metrology structure (Pong Ptr)
//! \param[in] algo  is a pointer to the EM SW Algorithm structure
//! \param[in] result  is a pointer to the EM SW Result structure
//!
//! \return None
//!
extern void EM_calcActiveEnergy(
        EM_Metrology *metro,
        EM_Algorithm_Configuration *algo,
        EM_Phase_Results *result);

//! \brief    The following API is used to calculate the dot product and
//! accumulation of Voltage_90 and Current. This API reads the current and voltage
//! values using the phase structure.It uses an IIR filter with 1 pole to shift the
//! the voltage 90 degrees: (all pass 90 degree filter for w = PI*f/fs, f=signal freq
//! and fs = sampling frequency)
//! V90(IDX0 = V(IDX-1)+G*[V(IDX) - V90(IDX-1)] G = (tan(w) - 1)/(tan(w) + 1)
//! The G constant used by the filter is based on signal
//! frequency which is updated ~ once a second. It updates metro Result structure;
//! storing the temporary multiply accumulate (MAC) calculations. The MAC value is
//! used by the foreground function EM_calcReactivePowerDiv to calculate Reactive Power.
//!
//! \param[in] metro  is a pointer to the EM SW Metrology structure (Ping Ptr)
//! \param[in] phase  is a pointer to the EM SW Phase structure
//! \param[in] bgData  is a pointer to the EM SW BG Result structure
//!
//! \return None
//!
extern void EM_calcReactivePowerMultAcc(
        EM_Metrology *metro,
        EM_Phase_Configuration *phase,
        EM_Phase_BG_Results *bgData);

//! \brief    The following API is used to calculate the reactive power in the
//! foreground code and store reactivePower in the result structure. The formula used:
//! (metro->RP_dot_prod->P_accum x metro->oneDivSC) x phase->phaseCalibPtr->reactivePowerSF
//! If the reactivePower calculated is less than algo->residualPowerCutoff
//! then reactivePower will be set to 0.
//!
//! \param[in] metro  is a pointer to the EM SW Metrology structure (Pong Ptr)
//! \param[in] phase  is a pointer to the EM SW Phase structure
//! \param[in] result  is a pointer to the EM SW Result structure
//! \param[in] algo  is a pointer to the EM SW Algorithm structure
//!
//! \return None
//!
extern void EM_calcReactivePowerDiv(
        EM_Metrology *metro,
        EM_Phase_Configuration *phase,
        EM_Phase_Results *result,
        EM_Algorithm_Configuration *algo);

//! \brief    The following API is used to calculate the reactive energy result.
//! The formula used to calculate reactiveEnergy (uVArh):
//! (result->reactivePower x metro->sampleCount) x energyCalcConst
//! Where energyCalcConst = (1/(sampling freq  x 3600))
//! This API must be called after EM_calcReactivePowerDiv.
//!
//! \param[in] metro  is a pointer to the EM SW Metrology structure (Pong Ptr)
//! \param[in] algo  is a pointer to the EM SW Algorithm structure
//! \param[in] result  is a pointer to the EM SW Result structure
//!
//! \return None
//!
extern void EM_calcReactiveEnergy(
        EM_Metrology *metro,
        EM_Algorithm_Configuration *algo,
        EM_Phase_Results *result);

//! \brief    The following API is used to calculate apparent power.
//! The formula used to calculate apparentPower (uVA):
//! Sqrt Root (result->activePower ^ 2 + result->reactivePower ^ 2)
//! This API must be called after EM_calcActivePowerMultAcc and
//! EM_calcReactivePowerMultAcc.
//!
//! \param[in] result  is a pointer to the EM SW Result structure
//!
//! \return None
//!
extern void EM_calcApparentPower(
        EM_Phase_Results *result);

