PiBoxY/msp430ware/energy_measurement/gui/DeviceConfig/SourceTemplates/MSP430i2xx/lib/EM/include/emSwLib.h
//! \brief    The following API is used to calculate the apparent energy result.
//! The formula used to calculate apparentEnergy (uVAh):
//! (result->apparentPower x metro->sampleCount) x energyCalcConst
//! Where energyCalcConst = (1/(sampling freq  x 3600))
//! This API must be called after EM_calcApparentPower.
//!
//! \param[in] metro  is a pointer to the EM SW Metrology structure (Pong Ptr)
//! \param[in] algo  is a pointer to the EM SW Algorithm structure
//! \param[in] result  is a pointer to the EM SW Result structure
//!
//! \return None
//!
extern void EM_calcApparentEnergy(
        EM_Metrology *metro,
        EM_Algorithm_Configuration *algo,
        EM_Phase_Results *result);
		
//! \brief    The following API is used to calculate power factor. The formula
//! used to calculate it:
//! activePower / apparentPower
//! This API must be called after EM_calcActivePowerMultAcc and
//! EM_calcApparentPower.
//!
//! \param[in] result  is a pointer to the EM SW Result structure
//!
//! \return None
//!
extern void EM_calcPowerFactor(
        EM_Phase_Results *result);

//! \brief    The following API is used to calculate the dot product and
//! accumulation for VRMS. This API reads the voltage value from the voltage ptr
//! in the phase structure and updates the Metro Result structure; storing
//! the temporary multiply accumulate (MAC) calculations. The MAC value is used
//! by the foreground function EM_calcVRMSDivSqrt to calculate VRMS.
//!
//! \param[in] metro  is a pointer to the EM SW Metrology structure (Ping Ptr)
//! \param[in] phase  is a pointer to the EM SW Phase structure
//!
//! \return None
//!
extern void EM_calcVRMSMultAcc(
        EM_Metrology *metro,
        EM_Phase_Configuration *phase);

//! \brief    The following API is used to calculate the division and
//! square root for VRMS. This API uses the dot product calculated by
//! the EM_calcVRMSMultAcc function. It updates the global Phase Result structure.
//! The result can be read inside the result structure.
//!
//! \param[in] metro  is a pointer to the EM SW Metrology structure (Pong Ptr)
//! \param[in] phase  is a pointer to the EM SW Phase structure
//! \param[in] result  is a pointer to the EM SW Library result handle
//!
//! \return None
//!
extern void EM_calcVRMSDivSqrt(
        EM_Metrology *metro,
        EM_Phase_Configuration *phase,
        EM_Phase_Results *result);
		
//! \brief    The following API is used to calculate the dot product and
//! accumulation for IRMS. This API reads the current value from the current ptr
//! in the phase structure and updates the Metro Result structure; storing
//! the temporary multiply accumulate (MAC) calculations. The MAC value is used
//! by the foreground function EM_calcIRMSDivSqrt to calculate IRMS.
//!
//! \param[in] metro  is a pointer to the EM SW Metrology structure (Ping Ptr)
//! \param[in] phase  is a pointer to the EM SW Phase structure
//!
//! \return None
//!
extern void EM_calcIRMSMultAcc(EM_Metrology *metro,
                               EM_Phase_Configuration *phase);

//! \brief    The following API is used to calculate the division and
//! square root for IRMS. This API uses the dot product calculated by
//! the EM_calcIRMSMultAcc function. It updates the global Phase Result structure.
//! The result can be read inside the result structure.
//!
//! \param[in] metro  is a pointer to the EM SW Metrology structure (Pong Ptr)
//! \param[in] phase  is a pointer to the EM SW Phase structure
//! \param[in] result  is a pointer to the EM SW Library result handle
//!
//! \return None
//!
extern void EM_calcIRMSDivSqrt(
        EM_Metrology *metro,
        EM_Phase_Configuration *phase,
        EM_Phase_Results *result);
		
//! \brief    The following API is used to calculate I Peak. This API updates
//! the global Phase Result structure. The formula used to calculate:
//! result->IRMS x algo->sqrtTwoConst
//! Where algo->sqrtTwoConst = Sqrt(2)
//! The result can be read inside the result structure.
//!
//! \param[in] result  is a pointer to the EM SW Result structure
//! \param[in] algo  is a pointer to the EM SW Algorithm structure
//!
//! \return None
//!
extern void EM_calcIPeak(
        EM_Phase_Results *result,
        EM_Algorithm_Configuration *algo);
		
//! \brief    The following API is used to calculate V Peak. This API updates
//! the global Phase Result structure.  The formula used to calculate:
//! result->VRMS x algo->sqrtTwoConst
//! Where algo->sqrtTwoConst = Sqrt(2)
//! The result can be read inside the result structure.
//!
//! \param[in] result  is a pointer to the EM SW Result structure
//! \param[in] algo  is a pointer to the EM SW Algorithm structure
//!
//! \return None
//!
extern void EM_calcVPeak(
        EM_Phase_Results *result,
        EM_Algorithm_Configuration *algo);

//! \brief    The following API is used to calculate the period of the voltage
//! signal. For systems with 2 voltages, this API must be used with only one
//! of the voltage signals. This API reads the voltage using the phase structure.
//! This API requires the initialization of the following using the function
//! count = (256 * Sampling Freq. / Fs ):
//! - EMSWLIB_EM_HAL_ADC_minFreqCount - should be calculated for Fs = 70 Hz
//! - EMSWLIB_EM_HAL_ADC_maxFreqCount - should be calculated for Fs = 40 Hz
//! For example For Sampling Freq = 4096,
//! minFreqCount  = (256*4096 / 70) = 14,980
//! maxFreqCount  = (256*4096 / 40) = 26,214
//! The Main Period is calculated using a running average of the main_period.
//! To calculate the period interpolation is used using a resolution of 256.
//! The period between two zero crossings (ZC_1 and ZC_2) is calculated using
//! the following formula:
//! Given,
//! XC_N (interpolated x value) = - 256 * Y_Prev / (Y_Act - Y_Prev)
//! Where Y_Prev and Y_Act are the Y values in the negative to positive transition
//! (e.g. Y_Prev < 0 and Y_Act >= 0 )
//! Delta_N = 256 - XC_N
//! Then,
//! Period_N = Delta_N-1 + 256*samples (not including Y_Prev and Y_Act) + XC_N
//! (e.g. for Period 2) = Delta_1 + 256*samples + XC_2
//!
//! \param[in] metro  is a pointer to the EM SW Metrology structure (Ping Ptr)
//! \param[in] phase  is a pointer to the EM SW Phase structure
//! \param[in] bgData  is a pointer to the EM SW BG Result structure
//!
//! \return None
//!
extern void EM_calcFreqPeriod(
        EM_Metrology *metro,
        EM_Phase_Configuration *phase,
        EM_Phase_BG_Results *bgData);

