PiBoxY/msp430ware/energy_measurement/gui/DeviceConfig/SourceTemplates/MSP430i2xx/lib/EM/include/emSwLib.h
//! \brief    The following API is used to calculate frequency. This API updates
//! the global Phase Result structure.  The formula used to calculate:
//! algo->freqSampling * 256L*100L / metro->mainPeriod
//! The result can be read inside the result structure.
//!
//! \param[in] metro  is a pointer to the EM SW Metrology structure (Pong Ptr)
//! \param[in] result  is a pointer to the EM SW Result structure
//! \param[in] algo  is a pointer to the EM SW Algorithm structure
//!
//! \return None
//!
extern void EM_calcFreq(
        EM_Metrology *metro,
        EM_Phase_Results *result,
        EM_Algorithm_Configuration *algo);

//! \brief    The following API is used to calculate total active power.
//! This API will aggregate the total power of the result->phaseResults
//! buffer using the indexes included in the phaseIdx buffer.
//!
//! \param[in] phaseIdx is a pointer to the phase indexes buffer
//! \param[in] length is the length of the phaseIdx buffer
//! \param[in] result is a pointer to the EM SW Result structure
//!
//! \return None
//!
extern void EM_calcTotalActivePower(
        uint8_t *phaseIdx,
        uint8_t length,
        EM_SW_Lib_Result_Handle *result);

//! \brief    The following API is used to calculate total reactive power.
//! This API will aggregate the total power of the result->phaseResults
//! buffer using the indexes included in the phaseIdx buffer.
//!
//! \param[in] phaseIdx is a pointer to the phase indexes buffer
//! \param[in] length is the length of the phaseIdx buffer
//! \param[in] result is a pointer to the EM SW Result structure
//!
//! \return None
//!
extern void EM_calcTotalReactivePower(
        uint8_t *phaseIdx,
        uint8_t length,
        EM_SW_Lib_Result_Handle *result);

//! \brief    The following API is used to calculate total apparent power.
//! This API will aggregate the total power of the result->phaseResults
//! buffer using the indexes included in the phaseIdx buffer.
//!
//! \param[in] phaseIdx is a pointer to the phase indexes buffer
//! \param[in] length is the length of the phaseIdx buffer
//! \param[in] result is a pointer to the EM SW Result structure
//!
//! \return None
//!
extern void EM_calcTotalApparentPower(
        uint8_t *phaseIdx,
        uint8_t length,
        EM_SW_Lib_Result_Handle *result);


//! \brief    The following API is used to calculate total active energy.
//! This API will aggregate the total energy of the result->phaseResults
//! buffer using the indexes included in the phaseIdx buffer.
//!
//! \param[in] phaseIdx is a pointer to the phase indexes buffer
//! \param[in] length is the length of the phaseIdx buffer
//! \param[in] result is a pointer to the EM SW Result structure
//!
//! \return None
//!
extern void EM_calcTotalActiveEnergy(
        uint8_t *phaseIdx,
        uint8_t length,
        EM_SW_Lib_Result_Handle *result);

//! \brief    The following API is used to calculate total reactive energy.
//! This API will aggregate the total energy of the result->phaseResults
//! buffer using the indexes included in the phaseIdx buffer.
//!
//! \param[in] phaseIdx is a pointer to the phase indexes buffer
//! \param[in] length is the length of the phaseIdx buffer
//! \param[in] result is a pointer to the EM SW Result structure
//!
//! \return None
//!
extern void EM_calcTotalReactiveEnergy(
        uint8_t *phaseIdx,
        uint8_t length,
        EM_SW_Lib_Result_Handle *result);

//! \brief    The following API is used to calculate total apparent energy.
//! This API will aggregate the total energy of the result->phaseResults
//! buffer using the indexes included in the phaseIdx buffer.
//!
//! \param[in] phaseIdx is a pointer to the phase indexes buffer
//! \param[in] length is the length of the phaseIdx buffer
//! \param[in] result is a pointer to the EM SW Result structure
//!
//! \return None
//!
extern void EM_calcTotalApparentEnergy(
        uint8_t *phaseIdx,
        uint8_t length,
        EM_SW_Lib_Result_Handle *result);

//******************************************************************************
//
// Close the Doxygen group.
//! @}
//
//******************************************************************************

#ifdef __cplusplus
}
#endif // extern "C"

#endif // end of  _EMSWLIB_H_ definition
